grevaillot/svd_tools/headers/ATSAMV71J20B/pmc.h
/** @defgroup pmc_pmc_pcr PMCPCR Peripheral Control Register
@{*/

/** PMC_PMC_PCR_GCLKEN Generic Clock Enable **/
#define PMC_PMC_PCR_GCLKEN		(1 << 29)
/** PMC_PMC_PCR_EN Enable **/
#define PMC_PMC_PCR_EN		(1 << 28)

#define PMC_PMC_PCR_GCLKDIV_SHIFT		20
#define PMC_PMC_PCR_GCLKDIV_MASK		0xff
/** @defgroup pmc_pmc_pcr_gclkdiv GCLKDIV Generic Clock Division Ratio
@{*/
/**@}*/

/** PMC_PMC_PCR_CMD Command **/
#define PMC_PMC_PCR_CMD		(1 << 12)

#define PMC_PMC_PCR_GCLKCSS_SHIFT		8
#define PMC_PMC_PCR_GCLKCSS_MASK		0x07
/** @defgroup pmc_pmc_pcr_gclkcss GCLKCSS Generic Clock Source Selection
@{*/
/**@}*/


#define PMC_PMC_PCR_PID_SHIFT		0
#define PMC_PMC_PCR_PID_MASK		0x7f
/** @defgroup pmc_pmc_pcr_pid PID Peripheral ID
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_ocr PMCOCR Oscillator Calibration Register
@{*/

/** PMC_PMC_OCR_SEL12 Selection of Main RC Oscillator Calibration Bits for 12 MHz **/
#define PMC_PMC_OCR_SEL12		(1 << 23)

#define PMC_PMC_OCR_CAL12_SHIFT		16
#define PMC_PMC_OCR_CAL12_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal12 CAL12 Main RC Oscillator Calibration Bits for 12 MHz
@{*/
/**@}*/

/** PMC_PMC_OCR_SEL8 Selection of Main RC Oscillator Calibration Bits for 8 MHz **/
#define PMC_PMC_OCR_SEL8		(1 << 15)

#define PMC_PMC_OCR_CAL8_SHIFT		8
#define PMC_PMC_OCR_CAL8_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal8 CAL8 Main RC Oscillator Calibration Bits for 8 MHz
@{*/
/**@}*/

/** PMC_PMC_OCR_SEL4 Selection of Main RC Oscillator Calibration Bits for 4 MHz **/
#define PMC_PMC_OCR_SEL4		(1 << 7)

#define PMC_PMC_OCR_CAL4_SHIFT		0
#define PMC_PMC_OCR_CAL4_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal4 CAL4 Main RC Oscillator Calibration Bits for 4 MHz
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_slpwk_er0 PMCSLPWKER0 SleepWalking Enable Register 0
@{*/

/** PMC_PMC_SLPWK_ER0_PID31 Peripheral 31 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID31		(1 << 31)
/** PMC_PMC_SLPWK_ER0_PID30 Peripheral 30 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID30		(1 << 30)
/** PMC_PMC_SLPWK_ER0_PID29 Peripheral 29 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID29		(1 << 29)
/** PMC_PMC_SLPWK_ER0_PID28 Peripheral 28 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID28		(1 << 28)
/** PMC_PMC_SLPWK_ER0_PID27 Peripheral 27 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID27		(1 << 27)
/** PMC_PMC_SLPWK_ER0_PID26 Peripheral 26 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID26		(1 << 26)
/** PMC_PMC_SLPWK_ER0_PID25 Peripheral 25 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID25		(1 << 25)
/** PMC_PMC_SLPWK_ER0_PID24 Peripheral 24 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID24		(1 << 24)
/** PMC_PMC_SLPWK_ER0_PID23 Peripheral 23 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID23		(1 << 23)
/** PMC_PMC_SLPWK_ER0_PID22 Peripheral 22 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID22		(1 << 22)
/** PMC_PMC_SLPWK_ER0_PID20 Peripheral 20 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID20		(1 << 20)
/** PMC_PMC_SLPWK_ER0_PID19 Peripheral 19 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID19		(1 << 19)
/** PMC_PMC_SLPWK_ER0_PID16 Peripheral 16 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID16		(1 << 16)
/** PMC_PMC_SLPWK_ER0_PID14 Peripheral 14 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID14		(1 << 14)
/** PMC_PMC_SLPWK_ER0_PID13 Peripheral 13 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID13		(1 << 13)
/** PMC_PMC_SLPWK_ER0_PID11 Peripheral 11 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID11		(1 << 11)
/** PMC_PMC_SLPWK_ER0_PID10 Peripheral 10 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID10		(1 << 10)
/** PMC_PMC_SLPWK_ER0_PID8 Peripheral 8 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID8		(1 << 8)
/** PMC_PMC_SLPWK_ER0_PID7 Peripheral 7 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER0_PID7		(1 << 7)

/**@}*/

/** @defgroup pmc_pmc_slpwk_dr0 PMCSLPWKDR0 SleepWalking Disable Register 0
@{*/

/** PMC_PMC_SLPWK_DR0_PID31 Peripheral 31 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID31		(1 << 31)
/** PMC_PMC_SLPWK_DR0_PID30 Peripheral 30 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID30		(1 << 30)
/** PMC_PMC_SLPWK_DR0_PID29 Peripheral 29 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID29		(1 << 29)
/** PMC_PMC_SLPWK_DR0_PID28 Peripheral 28 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID28		(1 << 28)
/** PMC_PMC_SLPWK_DR0_PID27 Peripheral 27 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID27		(1 << 27)
/** PMC_PMC_SLPWK_DR0_PID26 Peripheral 26 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID26		(1 << 26)
/** PMC_PMC_SLPWK_DR0_PID25 Peripheral 25 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID25		(1 << 25)
/** PMC_PMC_SLPWK_DR0_PID24 Peripheral 24 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID24		(1 << 24)
/** PMC_PMC_SLPWK_DR0_PID23 Peripheral 23 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID23		(1 << 23)
/** PMC_PMC_SLPWK_DR0_PID22 Peripheral 22 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID22		(1 << 22)
/** PMC_PMC_SLPWK_DR0_PID20 Peripheral 20 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID20		(1 << 20)
/** PMC_PMC_SLPWK_DR0_PID19 Peripheral 19 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID19		(1 << 19)
/** PMC_PMC_SLPWK_DR0_PID16 Peripheral 16 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID16		(1 << 16)
/** PMC_PMC_SLPWK_DR0_PID14 Peripheral 14 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID14		(1 << 14)
/** PMC_PMC_SLPWK_DR0_PID13 Peripheral 13 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID13		(1 << 13)
/** PMC_PMC_SLPWK_DR0_PID11 Peripheral 11 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID11		(1 << 11)
/** PMC_PMC_SLPWK_DR0_PID10 Peripheral 10 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID10		(1 << 10)
/** PMC_PMC_SLPWK_DR0_PID8 Peripheral 8 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID8		(1 << 8)
/** PMC_PMC_SLPWK_DR0_PID7 Peripheral 7 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR0_PID7		(1 << 7)

/**@}*/

/** @defgroup pmc_pmc_slpwk_sr0 PMCSLPWKSR0 SleepWalking Status Register 0
@{*/

/** PMC_PMC_SLPWK_SR0_PID31 Peripheral 31 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID31		(1 << 31)
/** PMC_PMC_SLPWK_SR0_PID30 Peripheral 30 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID30		(1 << 30)
/** PMC_PMC_SLPWK_SR0_PID29 Peripheral 29 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID29		(1 << 29)
/** PMC_PMC_SLPWK_SR0_PID28 Peripheral 28 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID28		(1 << 28)
/** PMC_PMC_SLPWK_SR0_PID27 Peripheral 27 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID27		(1 << 27)
/** PMC_PMC_SLPWK_SR0_PID26 Peripheral 26 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID26		(1 << 26)
/** PMC_PMC_SLPWK_SR0_PID25 Peripheral 25 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID25		(1 << 25)
/** PMC_PMC_SLPWK_SR0_PID24 Peripheral 24 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID24		(1 << 24)
/** PMC_PMC_SLPWK_SR0_PID23 Peripheral 23 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID23		(1 << 23)
/** PMC_PMC_SLPWK_SR0_PID22 Peripheral 22 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID22		(1 << 22)
/** PMC_PMC_SLPWK_SR0_PID20 Peripheral 20 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID20		(1 << 20)
/** PMC_PMC_SLPWK_SR0_PID19 Peripheral 19 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID19		(1 << 19)
/** PMC_PMC_SLPWK_SR0_PID16 Peripheral 16 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID16		(1 << 16)
/** PMC_PMC_SLPWK_SR0_PID14 Peripheral 14 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID14		(1 << 14)
/** PMC_PMC_SLPWK_SR0_PID13 Peripheral 13 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID13		(1 << 13)
/** PMC_PMC_SLPWK_SR0_PID11 Peripheral 11 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID11		(1 << 11)
/** PMC_PMC_SLPWK_SR0_PID10 Peripheral 10 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID10		(1 << 10)
/** PMC_PMC_SLPWK_SR0_PID8 Peripheral 8 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID8		(1 << 8)
/** PMC_PMC_SLPWK_SR0_PID7 Peripheral 7 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR0_PID7		(1 << 7)

/**@}*/

/** @defgroup pmc_pmc_slpwk_asr0 PMCSLPWKASR0 SleepWalking Activity Status Register 0
@{*/

/** PMC_PMC_SLPWK_ASR0_PID31 Peripheral 31 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID31		(1 << 31)
/** PMC_PMC_SLPWK_ASR0_PID30 Peripheral 30 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID30		(1 << 30)
/** PMC_PMC_SLPWK_ASR0_PID29 Peripheral 29 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID29		(1 << 29)
/** PMC_PMC_SLPWK_ASR0_PID28 Peripheral 28 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID28		(1 << 28)
/** PMC_PMC_SLPWK_ASR0_PID27 Peripheral 27 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID27		(1 << 27)
/** PMC_PMC_SLPWK_ASR0_PID26 Peripheral 26 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID26		(1 << 26)
/** PMC_PMC_SLPWK_ASR0_PID25 Peripheral 25 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID25		(1 << 25)
/** PMC_PMC_SLPWK_ASR0_PID24 Peripheral 24 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID24		(1 << 24)
/** PMC_PMC_SLPWK_ASR0_PID23 Peripheral 23 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID23		(1 << 23)
/** PMC_PMC_SLPWK_ASR0_PID22 Peripheral 22 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID22		(1 << 22)
/** PMC_PMC_SLPWK_ASR0_PID20 Peripheral 20 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID20		(1 << 20)
/** PMC_PMC_SLPWK_ASR0_PID19 Peripheral 19 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID19		(1 << 19)
/** PMC_PMC_SLPWK_ASR0_PID16 Peripheral 16 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID16		(1 << 16)
/** PMC_PMC_SLPWK_ASR0_PID14 Peripheral 14 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID14		(1 << 14)
/** PMC_PMC_SLPWK_ASR0_PID13 Peripheral 13 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID13		(1 << 13)
/** PMC_PMC_SLPWK_ASR0_PID11 Peripheral 11 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID11		(1 << 11)
/** PMC_PMC_SLPWK_ASR0_PID10 Peripheral 10 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID10		(1 << 10)
/** PMC_PMC_SLPWK_ASR0_PID8 Peripheral 8 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID8		(1 << 8)
/** PMC_PMC_SLPWK_ASR0_PID7 Peripheral 7 Activity Status **/
#define PMC_PMC_SLPWK_ASR0_PID7		(1 << 7)

/**@}*/

/** @defgroup pmc_pmc_pmmr PMCPMMR PLL Maximum Multiplier Value Register
@{*/


#define PMC_PMC_PMMR_PLLA_MMAX_SHIFT		0
#define PMC_PMC_PMMR_PLLA_MMAX_MASK		0x7ff
/** @defgroup pmc_pmc_pmmr_plla_mmax PLLAMMAX PLLA Maximum Allowed Multiplier Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_slpwk_er1 PMCSLPWKER1 SleepWalking Enable Register 1
@{*/

/** PMC_PMC_SLPWK_ER1_PID60 Peripheral 60 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID60		(1 << 28)
/** PMC_PMC_SLPWK_ER1_PID59 Peripheral 59 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID59		(1 << 27)
/** PMC_PMC_SLPWK_ER1_PID58 Peripheral 58 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID58		(1 << 26)
/** PMC_PMC_SLPWK_ER1_PID57 Peripheral 57 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID57		(1 << 25)
/** PMC_PMC_SLPWK_ER1_PID56 Peripheral 56 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID56		(1 << 24)
/** PMC_PMC_SLPWK_ER1_PID53 Peripheral 53 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID53		(1 << 21)
/** PMC_PMC_SLPWK_ER1_PID52 Peripheral 52 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID52		(1 << 20)
/** PMC_PMC_SLPWK_ER1_PID51 Peripheral 51 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID51		(1 << 19)
/** PMC_PMC_SLPWK_ER1_PID50 Peripheral 50 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID50		(1 << 18)
/** PMC_PMC_SLPWK_ER1_PID49 Peripheral 49 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID49		(1 << 17)
/** PMC_PMC_SLPWK_ER1_PID48 Peripheral 48 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID48		(1 << 16)
/** PMC_PMC_SLPWK_ER1_PID47 Peripheral 47 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID47		(1 << 15)
/** PMC_PMC_SLPWK_ER1_PID46 Peripheral 46 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID46		(1 << 14)
/** PMC_PMC_SLPWK_ER1_PID45 Peripheral 45 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID45		(1 << 13)
/** PMC_PMC_SLPWK_ER1_PID44 Peripheral 44 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID44		(1 << 12)
/** PMC_PMC_SLPWK_ER1_PID43 Peripheral 43 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID43		(1 << 11)
/** PMC_PMC_SLPWK_ER1_PID40 Peripheral 40 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID40		(1 << 8)
/** PMC_PMC_SLPWK_ER1_PID39 Peripheral 39 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID39		(1 << 7)
/** PMC_PMC_SLPWK_ER1_PID35 Peripheral 35 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID35		(1 << 3)
/** PMC_PMC_SLPWK_ER1_PID34 Peripheral 34 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID34		(1 << 2)
/** PMC_PMC_SLPWK_ER1_PID33 Peripheral 33 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID33		(1 << 1)
/** PMC_PMC_SLPWK_ER1_PID32 Peripheral 32 SleepWalking Enable **/
#define PMC_PMC_SLPWK_ER1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_slpwk_dr1 PMCSLPWKDR1 SleepWalking Disable Register 1
@{*/

